sergev/LiteBSD/sys/mips/pic32/machdep.c
/*
 * Copyright (c) 1988 University of Utah.
 * Copyright (c) 1992, 1993
 *      The Regents of the University of California.  All rights reserved.
 *
 * This code is derived from software contributed to Berkeley by
 * the Systems Programming Group of the University of Utah Computer
 * Science Department, The Mach Operating System project at
 * Carnegie-Mellon University and Ralph Campbell.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. All advertising materials mentioning features or use of this software
 *    must display the following acknowledgement:
 *      This product includes software developed by the University of
 *      California, Berkeley and its contributors.
 * 4. Neither the name of the University nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 *      @(#)machdep.c   8.5 (Berkeley) 6/2/95
 */

/* from: Utah $Hdr: machdep.c 1.63 91/04/24$ */

#include <sys/param.h>
#include <sys/systm.h>
#include <sys/signalvar.h>
#include <sys/kernel.h>
#include <sys/map.h>
#include <sys/proc.h>
#include <sys/buf.h>
#include <sys/reboot.h>
#include <sys/conf.h>
#include <sys/file.h>
#include <sys/clist.h>
#include <sys/callout.h>
#include <sys/malloc.h>
#include <sys/mbuf.h>
#include <sys/msgbuf.h>
#include <sys/ioctl.h>
#include <sys/tty.h>
#include <sys/user.h>
#include <sys/exec.h>
#include <sys/sysctl.h>
#include <sys/mount.h>
#include <sys/syscallargs.h>
#ifdef SYSVSHM
#include <sys/shm.h>
#endif

#include <vm/vm_kern.h>

#include <machine/cpu.h>
#include <machine/reg.h>
#include <machine/psl.h>
#include <machine/pte.h>
#include <machine/pic32mz.h>

#include <mips/dev/device.h>
#include <mips/dev/sccreg.h>
#include <mips/dev/ascreg.h>

/* the following is used externally (sysctl_hw) */
char    machine[] = "MIPS";     /* cpu "architecture" */
char    cpu_model[30];

vm_map_t buffer_map;

/*
 * Declare these as initialized data so we can patch them.
 */
int     nswbuf = 0;

#ifndef NBUF
#define NBUF 0
#endif
int     nbuf = NBUF;

#ifndef BUFPAGES
#define BUFPAGES 0
#endif
int     bufpages = BUFPAGES;

int     msgbufmapped = 0;       /* set when safe to use msgbuf */
int     maxmem;                 /* max memory per process */
int     physmem;                /* max supported memory, changes to actual */

extern dev_t cn_dev;

/*
 * safepri is a safe priority for sleep to set for a spin-wait
 * during autoconfiguration or after a panic.
 */
int     safepri = PSL_LOWIPL;

struct  user *proc0paddr;
struct  proc nullproc;          /* for use by swtch_exit() */

/*
 * Do all the stuff that locore normally does before calling main().
 * Return the first page address following the system.
 */
mach_init()
{
    register char *cp;
    register int i;
    register unsigned firstaddr;
    register caddr_t v;
    caddr_t start;
    extern char __data_start[], _edata[], _end[];
    extern char MachUTLBMiss[], MachUTLBMissEnd[];
    extern char MachException[], MachExceptionEnd[];
    extern void _etext();

    /* Initialize .data + .bss segments by zeroes. */
    v = (caddr_t)mips_round_page(_end);
    bzero (__data_start, v - _edata);

#ifndef __MPLABX__
    /* Copy the .data image from flash to ram.
     * Linker places it at the end of .text segment. */
    unsigned *src = (unsigned*) _etext;
    unsigned *dest = (unsigned*) __data_start;
    unsigned *limit = (unsigned*) _edata;
    while (dest < limit) {
        /*printf ("copy %08x from (%08x) to (%08x)\n", *src, src, dest);*/
        *dest++ = *src++;
    }
#else
    /* Microchip C32 compiler generates a .dinit table with
     * initialization values for .data segment. */
    extern const unsigned _dinit_addr[];
    unsigned const *dinit = &_dinit_addr[0];
    for (;;) {
            char *dst = (char*) (*dinit++);
            if (dst == 0)
                    break;

            unsigned nbytes = *dinit++;
            unsigned fmt = *dinit++;
            if (fmt == 0) {                     /* Clear */
                    do {
                            *dst++ = 0;
                    } while (--nbytes > 0);
            } else {                            /* Copy */
                    char *src = (char*) dinit;
                    do {
                            *dst++ = *src++;
                    } while (--nbytes > 0);
                    dinit = (unsigned*) ((unsigned) (src + 3) & ~3);
            }
    }
#endif

    /*
     * Autoboot by default.
     */
    boothowto = 0;
    if (1) {                        // TODO
        /* Boot to single user mode. */
        boothowto |= RB_SINGLE;
    }

    /*
     * Init mapping for u page(s) for proc[0], pm_tlbpid 1.
     */
    start = v;
    proc0paddr = (struct user *)v;
    curproc->p_addr = proc0paddr;
    curproc->p_md.md_regs = proc0paddr->u_pcb.pcb_regs;
    firstaddr = MACH_CACHED_TO_PHYS(v);
    for (i = 0; i < UPAGES; i++) {
        curproc->p_md.md_upte[i] = PG_PFNUM(firstaddr) | PG_V | PG_D;
        firstaddr += NBPG;
    }
    MachTLBWriteIndexed(0, UADDR | 1, curproc->p_md.md_upte[0],
                                      curproc->p_md.md_upte[1]);
    v += UPAGES * NBPG;
    MachSetPID(1);

