sergev/LiteBSD/sys/mips/pic32/machdep.c
    /* 184 - I2C5 Master Event
     * 185 - SPI6 Fault
     * 186 - SPI6 Receive Done
     * 187 - SPI6 Transfer Done */
    IPC(46) = PIC32_IPC_IP0(0) | PIC32_IPC_IP1(3) | PIC32_IPC_IP2(3) | PIC32_IPC_IP3(3);

    /* 188 - UART6 Fault
     * 189 - UART6 Receive Done
     * 190 - UART6 Transfer Done
     * 191 - Reserved */
    IPC(47) = PIC32_IPC_IP0(5) | PIC32_IPC_IP1(5) | PIC32_IPC_IP2(5) | PIC32_IPC_IP3(0);
}

void
initcpu()
{
    /* disable clock interrupts (until startrtclock()) */
#if 0
    // TODO: pic32
    register volatile struct chiptime *c = Mach_clock_addr;
    c->regb = REGB_DATA_MODE | REGB_HOURS_FORMAT;
    (void) c->regc;
#endif
    spl0();         /* safe to turn interrupts on now */
}

/*
 * cpu_startup: allocate memory for variable-sized tables,
 * initialize cpu, and do autoconfiguration.
 */
cpu_startup()
{
    register unsigned i;
    register caddr_t v;
    int base, residual;
    vm_offset_t minaddr, maxaddr;
    vm_size_t size;

    /*
     * Good {morning,afternoon,evening,night}.
     */
    printf(version);
    printf("real mem = %d\n", ctob(physmem));

    /*
     * Allocate virtual address space for file I/O buffers.
     * Note they are different than the array of headers, 'buf',
     * and usually occupy more virtual memory than physical.
     */
    size = MAXBSIZE * nbuf;
    buffer_map = kmem_suballoc(kernel_map, (vm_offset_t *)&buffers,
                   &maxaddr, size, TRUE);
    minaddr = (vm_offset_t)buffers;
    if (vm_map_find(buffer_map, vm_object_allocate(size), (vm_offset_t)0,
            &minaddr, size, FALSE) != KERN_SUCCESS)
        panic("startup: cannot allocate buffers");
    base = bufpages / nbuf;
    residual = bufpages % nbuf;
    for (i = 0; i < nbuf; i++) {
        vm_size_t curbufsize;
        vm_offset_t curbuf;

        /*
         * First <residual> buffers get (base+1) physical pages
         * allocated for them.  The rest get (base) physical pages.
         *
         * The rest of each buffer occupies virtual space,
         * but has no physical memory allocated for it.
         */
        curbuf = (vm_offset_t)buffers + i * MAXBSIZE;
        curbufsize = CLBYTES * (i < residual ? base+1 : base);
        vm_map_pageable(buffer_map, curbuf, curbuf+curbufsize, FALSE);
        vm_map_simplify(buffer_map, curbuf);
    }
    /*
     * Allocate a submap for exec arguments.  This map effectively
     * limits the number of processes exec'ing at any time.
     */
    exec_map = kmem_suballoc(kernel_map, &minaddr, &maxaddr,
                 16 * NCARGS, TRUE);
    /*
     * Allocate a submap for physio
     */
    phys_map = kmem_suballoc(kernel_map, &minaddr, &maxaddr,
                 VM_PHYS_SIZE, TRUE);

    /*
     * Finally, allocate mbuf pool.  Since mclrefcnt is an off-size
     * we use the more space efficient malloc in place of kmem_alloc.
     */
    mclrefcnt = (char *)malloc(NMBCLUSTERS+CLBYTES/MCLBYTES,
                   M_MBUF, M_NOWAIT);
    bzero(mclrefcnt, NMBCLUSTERS+CLBYTES/MCLBYTES);
    mb_map = kmem_suballoc(kernel_map, (vm_offset_t *)&mbutl, &maxaddr,
                   VM_MBUF_SIZE, FALSE);
    /*
     * Initialize callouts
     */
    callfree = callout;
    for (i = 1; i < ncallout; i++)
        callout[i-1].c_next = &callout[i];
    callout[i-1].c_next = NULL;

    printf("avail mem = %d\n", ptoa(cnt.v_free_count));
    printf("using %d buffers containing %d bytes of memory\n",
        nbuf, bufpages * CLBYTES);
    /*
     * Set up CPU-specific registers, cache, etc.
     */
    initcpu();

    /*
     * Set up buffers, so they can be used to read disk labels.
     */
    bufinit();

    /*
     * Configure the system.
     */
    configure();
}

/*
 * machine dependent system variables.
 */
cpu_sysctl(name, namelen, oldp, oldlenp, newp, newlen, p)
    int *name;
    u_int namelen;
    void *oldp;
    size_t *oldlenp;
    void *newp;
    size_t newlen;
    struct proc *p;
{

    /* all sysctl names at this level are terminal */
    if (namelen != 1)
        return (ENOTDIR);               /* overloaded */

    switch (name[0]) {
    case CPU_CONSDEV:
        return (sysctl_rdstruct(oldp, oldlenp, newp, &cn_dev,
            sizeof cn_dev));
    default:
        return (EOPNOTSUPP);
    }
    /* NOTREACHED */
}

/*
 * Set registers on exec.
 * Clear all registers except sp, pc.
 */
setregs(p, entry, retval)
    register struct proc *p;
    u_long entry;
    register_t retval[2];
{
    int sp = p->p_md.md_regs[SP];

    bzero((caddr_t)p->p_md.md_regs, (FSR + 1) * sizeof(int));
    p->p_md.md_regs[SP] = sp;
    p->p_md.md_regs[PC] = entry & ~3;
    p->p_md.md_regs[PS] = PSL_USERSET;
    p->p_md.md_flags & ~MDP_FPUSED;
}

/*
 * WARNING: code in locore.s assumes the layout shown for sf_signum
 * thru sf_handler so... don't screw with them!
 */
struct sigframe {
    int     sf_signum;              /* signo for handler */
    int     sf_code;                /* additional info for handler */
    struct  sigcontext *sf_scp;     /* context ptr for handler */
    sig_t   sf_handler;             /* handler addr for u_sigc */
    struct  sigcontext sf_sc;       /* actual context */
};

/*
 * Send an interrupt to process.
 */
void
sendsig(catcher, sig, mask, code)
    sig_t catcher;
    int sig, mask;
    u_long code;
{
    register struct proc *p = curproc;
    register struct sigframe *fp;
    register int *regs;
    register struct sigacts *psp = p->p_sigacts;
    int oonstack, fsize;
    struct sigcontext ksc;
    extern char sigcode[], esigcode[];

    regs = p->p_md.md_regs;
    oonstack = psp->ps_sigstk.ss_flags & SA_ONSTACK;
    /*
     * Allocate and validate space for the signal handler
     * context. Note that if the stack is in data space, the
     * call to grow() is a nop, and the copyout()
     * will fail if the process has not already allocated
     * the space with a `brk'.
     */
    fsize = sizeof(struct sigframe);
    if ((psp->ps_flags & SAS_ALTSTACK) &&
        (psp->ps_sigstk.ss_flags & SA_ONSTACK) == 0 &&
        (psp->ps_sigonstack & sigmask(sig))) {
        fp = (struct sigframe *)(psp->ps_sigstk.ss_base +
                     psp->ps_sigstk.ss_size - fsize);
        psp->ps_sigstk.ss_flags |= SA_ONSTACK;
    } else
        fp = (struct sigframe *)(regs[SP] - fsize);
    if ((unsigned)fp <= USRSTACK - ctob(p->p_vmspace->vm_ssize))
        (void)grow(p, (unsigned)fp);

