sergev/LiteBSD/sys/mips/pic32/machdep.c
/*
 * Return the best possible estimate of the time in the timeval
 * to which tvp points.  Unfortunately, we can't read the hardware registers.
 * We guarantee that the time will be greater than the value obtained by a
 * previous call.
 */
void
microtime(tvp)
    struct timeval *tvp;
{
    int s = splclock();
    static struct timeval lasttime;

    *tvp = time;
#ifdef notdef
    tvp->tv_usec += clkread();
    while (tvp->tv_usec > 1000000) {
        tvp->tv_sec++;
        tvp->tv_usec -= 1000000;
    }
#endif
    if (tvp->tv_sec == lasttime.tv_sec &&
        tvp->tv_usec <= lasttime.tv_usec &&
        (tvp->tv_usec = lasttime.tv_usec + 1) > 1000000) {
        tvp->tv_sec++;
        tvp->tv_usec -= 1000000;
    }
    lasttime = *tvp;
    splx(s);
}

/*
 * Convert an ASCII string into an integer.
 */
int
atoi(s)
    char *s;
{
    int c;
    unsigned base = 10, d;
    int neg = 0, val = 0;

    if (s == 0 || (c = *s++) == 0)
        goto out;

    /* skip spaces if any */
    while (c == ' ' || c == '\t')
        c = *s++;

    /* parse sign, allow more than one (compat) */
    while (c == '-') {
        neg = !neg;
        c = *s++;
    }

    /* parse base specification, if any */
    if (c == '0') {
        c = *s++;
        switch (c) {
        case 'X':
        case 'x':
            base = 16;
            break;
        case 'B':
        case 'b':
            base = 2;
            break;
        default:
            base = 8;
        }
    }

    /* parse number proper */
    for (;;) {
        if (c >= '0' && c <= '9')
            d = c - '0';
        else if (c >= 'a' && c <= 'z')
            d = c - 'a' + 10;
        else if (c >= 'A' && c <= 'Z')
            d = c - 'A' + 10;
        else
            break;
        val *= base;
        val += d;
        c = *s++;
    }
    if (neg)
        val = -val;
out:
    return val;
}

/*
 * Delay for a given number of microseconds.
 * The processor has a 32-bit hardware Count register,
 * which increments at half CPU rate.
 * We use it to get a precise delay.
 */
void udelay (unsigned usec)
{
    unsigned now = mfc0 (9, 0); // C0_Count
    unsigned final = now + usec * CPU_KHZ / 2000;

    for (;;) {
    now = mfc0 (9, 0); // C0_Count

    /* This comparison is valid only when using a signed type. */
    if ((int) (now - final) >= 0)
        break;
    }
}
